{
  "Project_and_Research": [
    "Describe a specific engineering or community challenge you encountered in the past,either through coursework, fieldwork, or personal observation. Walk us through how you approached it: What was your initial reaction? What did you do to understand the problem deeper? What obstacles did you face, and how did you overcome them? What would you do differently if you faced the same challenge today, and why?(min 300 words)",

    "Outside of your formal curriculum, is there an engineering problem, sustainability issue, or social challenge related to Nepal or your community that genuinely intrigues you? Describe what fascinates you about it, what questions it raises for you, and what you've already done (or want to do) to explore it further. Why is this meaningful to you personally, not just professionally?(min 300 words)",

    "Tell us about a time when you committed to a project or goal, but halfway through, you realized it was more difficult, time-consuming, or different than you expected. How did you respond? Did you continue, pivot, or step back? What did this experience teach you about your own commitment and resilience? How would this lesson influence your contribution to EWB projects?(min 200 words)"
  ],
  "Outreach_Management": [
    "List out the possible situations where EWB Pulchowk would need to approach other EWB teams.",

    "What are the sets of personality and traits that are required for maintaining good relationships with collaborators?",

    "Describe your eligibility to work in the outreach managing team."
  ],
  "Event_Management": [
    "What kind of events do you think EWB Pulchowk should focus on? Explain at least two events that you think are feasible in ewb pullchowk and explain how you would carry out various steps as an event managing team to carry out those events.",
    "How would you make our events more engaging for students?",
    "How do you break down a big task into smaller tasks? Give an example.",
    "Are you comfortable approaching people (mentors, founders, organizations) for collaboration? Give an example.",
    "How would you initiate contact with someone you want to invite for a session or partnership?",
    "Describe a business idea you once thought about (even if you never built it). What inspired it?"
  ],
  "Social_Media_and_PR": [
    "How flexible are you in handling Discord moderation, community management, bot configuration, and event coordination?",
    "Can you provide an overview of any previous experience in similar roles?",
    "If selected as a Social Media Manager and PR coordinator, how would you contribute to the growth and promotion of EWB?"
  ],
  "Technical": [
    "How would you rate your comfort level with web development, and which tech stack are you most confident using?",
    "Have you completed any projects so far? If yes, please describe them or share relevant links.",
    "If you have been given any AI tool's premium version free as long as you want. What would you build with it"
  ],
  "Finance_Coordinator": [
    "How would you plan, manage, and monitor the budget for an event or project, and what steps would you take if the expenses start exceeding the planned amount?",
    "What methods or tools do you use to keep financial records accurate and transparent, and how would you ensure that all team members follow proper financial procedures?",
    "Can you explain how you would evaluate expenses and prioritize spending when the budget is limited but multiple activities need funding?"
  ],
  "Creative": [
    "What draws you to the Creative team at EWB, and how do you think creative work contributes to EWB’s mission and impact?",
    "Please describe any experiences or projects you have worked on that involved creative work (academic, extracurricular, or personal). For each experience, explain your role, the skills you developed, and the software or tools you used. Additionally, list any other software or tools you are proficient in or capable of using.",
    "Creative teams often balance multiple tasks and deadlines at once. How do you manage your workload and stay organized when working on several responsibilities at the same time?"
  ]
}
